# flake8: noqa

welcome_texts = [
    {
        "text": "Вдохновлять я люблю! А помогут мне в этом эксперты и резиденты арт-{кластера}{кл`астэра} «Тавр`ида». Это творческие люди, которые сумели воплотить свои мечты. Я верю, что их истории зажгут в вас искру! Ну что, ^послушаем^?",
        "tts": "Вдохновлять я люблю! А помогут мне в этом эксперты и резиденты арт-{кластера}{кл`астэра} «Тавр`ида». Это творческие люди, которые сумели воплотить свои мечты. Я верю, что их истории зажгут в вас искру! Ну что, ^послушаем^?",
    },
    {
        "text": "Послушайте вдохновляющие истории от экспертов и резидентов арт-{кластера}{кл`астэра} «Тавр`ида» и зарядитесь их энергией! Эти талантливые люди расскажут, как они добились успеха в творчестве, и зажгут в вас искру. Ну что, начнём?",
        "tts": "Послушайте вдохновляющие истории от экспертов и резидентов арт-{кластера}{кл`астэра} «Тавр`ида» и зарядитесь их энергией! Эти талантливые люди расскажут, как они добились успеха в творчестве, и зажгут в вас искру. Ну что, начнём?",
    },
    {
        "text": "Послушайте вдохновляющие истории от экспертов и резидентов арт-{кластера}{кл`астэра} «Тавр`ида» и поверьте в свой успех! Ну что, начнём?",
        "tts": "Послушайте вдохновляющие истории от экспертов и резидентов арт-{кластера}{кл`астэра} «Тавр`ида» и поверьте в свой успех! Ну что, начнём?",
    },
    {
        "text": "Послушайте вдохновляющие истории успеха от экспертов и резидентов арт-{кластера}{кл`астэра} «Тавр`ида». Я верю, что ваши мечты тоже сбудутся! ^Готовы^ к первой истории?",
        "tts": "Послушайте вдохновляющие истории успеха от экспертов и резидентов арт-{кластера}{кл`астэра} «Тавр`ида». Я верю, что ваши мечты тоже сбудутся! ^Готовы^ к первой истории?",
    },
    {
        "text": "Послушайте истории успеха от экспертов и резидентов арт-{кластера}{кл`астэра} «Тавр`ида» и вдохновитесь на собственные достижения! Ну что, начнём?",
        "tts": "Послушайте истории успеха от экспертов и резидентов арт-{кластера}{кл`астэра} «Тавр`ида» и вдохновитесь на собственные достижения! Ну что, начнём?",
    }
]

welcome_suggest = [{'title': 'Начать', 'hide': True}]

next_synonyms = [
    "да",
    "ну да",
    "окей",
    "хочу",
    "я хочу",
    "да, хочу",
    "давай",
    "ну давай",
    "да, давай",
    "валяй",
    "ну валяй",
    "хорошо",
    "ага",
    "угу",
    "конечно",
    "разумеется",
    "ещё бы",
    "интересно",
    "мне интересно",
    "погнали",
    "поехали",
    "начинай",
    "начать",
    "начинаем",
    "давай начинай",
    "включи",
    "включай",
    "давай включай",
    "послушаем",
    "давай послушаем",
    "хочу послушать",
    "интересно послушать",
    "послушать",
    "слушаем",
    "слушать",
    "давай слушать",
    "готов",
    "готова",
    "готовы",
]

next_phrases = [
    {
        "text": "Это было ^впечатляюще^! ^Включить^ следующую историю?",
        "tts": "Это было ^впечатляюще^! ^Включить^ следующую историю?",
    },
    {
        "text": "Хотите новую историю?",
        "tts": "Хотите новую историю?",
    },
    {
        "text": "Очень вдохновляет! Хотите ^ещё^ историю?",
        "tts": "Очень вдохновляет! Хотите ^ещё^ историю?",
    },
    {
        "text": "Послушаем ^ещё^ одну историю?",
        "tts": "Послушаем ^ещё^ одну историю?",
    }
]

stories = [
    {
        "text": "Хотите новую историю?",
        "tts": "Хотите новую историю?",
        "audio_url": "https://wdfiles.ru/49cba3e",
        "audio_title": "title 1",
        "audio_subtitle": "subtitle 1",
    },
    {
        "text": "Хотите новую историю?",
        "tts": "Хотите новую историю?",
        "audio_url": "https://wdfiles.ru/49cba3e",
        "audio_title": "title 2",
        "audio_subtitle": "subtitle 2",
    },
    {
        "text": "Хотите новую историю?",
        "tts": "Хотите новую историю?",
        "audio_url": "https://wdfiles.ru/49cba3e",
        "audio_title": "title 3",
        "audio_subtitle": "subtitle 3",
    },
]

next_suggests = [{'title': 'Ещё', 'hide': True}]

stop_synonyms = [
    "нет",
    "не надо",
    "не, не надо",
    "не нужно",
    "не стоит",
    "не хочу",
    "не, не хочу",
    "не хочется",
    "что-то не хочется",
    "неинтересно",
    "стоп",
    "выход",
    "отмена",
    "отменить",
    "отбой",
    "хватит",
    "остановись",
    "не начинай",
    "не начать",
    "выключи",
    "выключись",
    "выключай",
    "выключить",
    "выруби",
    "вырубай",
    "перестань",
    "прекрати",
    "отвали",
    "отвянь",
    "замолкни",
    "замолчи",
    "заткнись",
    "забей",
    "это не то",
    "это не то, что я ожидал",
    "это не то, что я ожидала",
    "в другой раз",
    "не сейчас",
    "потом",
]

more_synonyms = [
    "ещё",
    "ещё историю",
    "больше",
    "больше историй",
    "дальше",
    "другая",
    "другую",
    "другая история",
    "другую историю",
    "следуюшая",
    "следующую",
    "следуюшая история",
    "следующую историю",
    "новая",
    "новую",
    "новая история",
    "новую историю",
    "хочу ещё",
    "хочу ещё историю",
    "хочу больше",
    "хочу больше историй",
    "хочу дальше",
    "хочу другую",
    "хочу другую историю",
    "хочу следующую",
    "хочу следующую историю",
    "хочу новую",
    "хочу новую историю",
    "давай ещё",
    "давай ещё историю",
    "давай дальше",
    "давай другую",
    "давай другую историю",
    "давай следующую",
    "давай следующую историю",
    "давай новую",
    "давай новую историю",
    "расскажи ещё",
    "расскажи ещё историю",
    "расскажи больше",
    "расскажи больше историй",
    "расскажи дальше",
    "рассказывай дальше",
    "расскажи другую",
    "расскажи другую историю",
    "расскажи следующую",
    "расскажи следующую историю",
    "расскажи новую",
    "расскажи новую историю",
    "включи ещё",
    "включи ещё историю",
    "включи другую",
    "включи другую историю",
    "включи следующую",
    "включи следующую историю",
    "включи новую",
    "включи новую историю",
]

unclear = {
    "text": "Извините, не поняла. Скажите «начать» чтобы послушать вдохновляющую историю",
    "tts": "Извините, не поняла. Скажите: «Начать» — чтобы послушать вдохновляющую историю",
}

exit_phrases = [
    {
        "text": "Буду ждать вас с новой порцией вдохновения!",
        "tts": "Буду ждать вас с новой порцией вдохновения!",
    },
    {
        "text": "Тогда в другой раз. И помните, что я в вас верю!",
        "tts": "Тогда в другой раз. И помните, что я в вас верю!",
    },
    {
        "text": "У вас всё получится! А если нужно будет вдохновение, обращайтесь",
        "tts": "У вас всё получится! А если нужно будет вдохновение, обращайтесь",
    },
    {
        "text": "Буду ждать вас снова. И помните, вы лучше всех!",
        "tts": "Буду ждать вас снова. И помните, вы лучше всех!",
    }
]
